pschatzmann/NanoTangArduino/boards.txt
menu.none=none
menu.optimize=Optimize
menu.ai_accel=AI Accelerator
menu.sd_card=SD Card
menu.exceptions=C++ Exceptions
menu.boot_mode=Boot Mode
menu.spi_buses=SPI Buses
menu.i2c_buses=I2C Buses
menu.hw_muldiv=Hardware Multiply/Divide
menu.i2s_rx=I2S Input
menu.pwm_audio=PWM Audio
menu.flash_cache=Flash Cache
menu.f_cpu=Clock Speed
menu.compressed=Compressed Instructions
menu.barrel_shifter=Barrel Shifter
menu.can=CAN

## Sipeed Tang Nano 20K (PicoRV32 soft-SoC)
## ------------------------------------------
tangnano20k.name=Tang Nano 20K (PicoRV32 SoC)

tangnano20k.build.core=tangnano20k
tangnano20k.build.variant=tangnano20k
tangnano20k.build.mcu=picorv32
tangnano20k.build.board=TANGNANO20K
tangnano20k.build.march_m=m
tangnano20k.build.march_c=
tangnano20k.build.mabi=ilp32
tangnano20k.build.sram_addr_width=14

tangnano20k.upload.tool=tangnano20k_upload
# arduino-cli/IDE 2.x select the upload tool per port protocol (pluggable
# discovery); openFPGALoader finds the board by USB ID, so any port - or
# none - uses the same tool.
tangnano20k.upload.tool.default=tangnano20k_upload
tangnano20k.upload.tool.serial=tangnano20k_upload
# arduino-cli refuses to upload without a programmer unless upload.protocol
# is set; the value is informational only (tools/upload.py ignores it).
tangnano20k.upload.protocol=openfpgaloader
tangnano20k.upload.maximum_size=65536
tangnano20k.upload.maximum_data_size=65536

# Tools > Optimize. Code size matters more than usual here (64KB of
# internal SRAM holds the whole program, not just a "no room for more
# libraries" inconvenience), so the default is -Os; -O2/-O3 trade that
# for speed, and Debug adds -g without changing the actual optimization
# level much (debug info isn't part of what gets baked into SRAM - see
# tools/build_bitstream.py - so it doesn't cost SRAM budget).
tangnano20k.menu.optimize.small=Small (-Os) (Default)
tangnano20k.menu.optimize.small.build.optimization_flags=-Os
tangnano20k.menu.optimize.fast=Fast (-O2)
tangnano20k.menu.optimize.fast.build.optimization_flags=-O2
tangnano20k.menu.optimize.fastest=Fastest (-O3)
tangnano20k.menu.optimize.fastest.build.optimization_flags=-O3
tangnano20k.menu.optimize.debug=Debug (-Og -g)
tangnano20k.menu.optimize.debug.build.optimization_flags=-Og -g

# Tools > AI Accelerator. Unlike a software library (only linked in if a
# sketch #includes it), gateware/src/ai_accel_bus.v's dot-product engine
# gets synthesized into the bitstream unconditionally if it's present at
# all - see tools/build_bitstream.py and top.v's `ifdef WITH_AI_ACCEL.
# Disabled by default: most sketches don't use it, and it's a real
# LUT/BRAM cost on a chip this size, not a free one.
tangnano20k.menu.ai_accel.disabled=Disabled (Default)
tangnano20k.menu.ai_accel.disabled.build.ai_accel=0
tangnano20k.menu.ai_accel.enabled=Enabled
tangnano20k.menu.ai_accel.enabled.build.ai_accel=1

# Tools > SD Card. Different reason than AI Accelerator above: libraries/SD
# is GPLv3 (see docs/LICENSING.md), and its inclusion is otherwise gated
# only by whether a sketch happens to write `#include <SD.h>`. Disabled by
# default requires an explicit menu choice - not just an #include - before
# a sketch takes on that license. Enabling it does NOT change the
# gateware/bitstream at all (libraries/SD is pure software on top of the
# always-present SPI peripheral) - this menu only makes libraries/SD/src/SD.h
# itself compile instead of erroring out.
tangnano20k.menu.sd_card.disabled=Disabled (Default)
tangnano20k.menu.sd_card.disabled.build.sd_defines=
tangnano20k.menu.sd_card.enabled=Enabled (GPLv3)
tangnano20k.menu.sd_card.enabled.build.sd_defines=-DTANGNANO20K_SD_ENABLED

# Tools > C++ Exceptions. Disabled by default: this core is -nostdlib with
# no libsupc++/libstdc++, so enabling exceptions doesn't give you a
# working `throw`/`catch` by itself - __cxa_throw, _Unwind_Resume, and
# __gxx_personality_v0 are still unresolved unless you bring your own
# freestanding C++ runtime support. See platform.txt.
tangnano20k.menu.exceptions.disabled=Disabled (Default)
tangnano20k.menu.exceptions.disabled.build.exceptions_flags=-fno-exceptions
tangnano20k.menu.exceptions.enabled=Enabled
tangnano20k.menu.exceptions.enabled.build.exceptions_flags=-fexceptions

# Tools > Boot Mode. SRAM (default) is today's model unchanged: the
# sketch is baked directly into internal SRAM at synthesis time, so every
# upload re-runs the full FPGA flow (~1-3 minutes) - see
# tools/build_bitstream.py. Flash boots a small fixed stub
# (cores/tangnano20k/boot.S) from SRAM that copies the sketch from the
# onboard SPI flash instead; because that stub never changes per-sketch,
# the bitstream itself only needs rebuilding when the *core* changes, and
# ordinary uploads become a fast flash write - see docs/BUILDING.md and
# docs/PERIPHERALS.md "Flash". The upload writes that fixed core
# bitstream to flash (only when it changed) and the sketch after it, so
# the board starts the sketch by itself at power-up.
#
# The "+ SDRAM" entries are for sketches too big for the 64KB internal
# SRAM: they link with link_cmd_sdram.ld, which keeps the core, libgcc's
# integer/float helpers, the helix MP3 decoder and the timing-sensitive
# bundled libraries in SRAM and puts all other code and constants in the
# embedded SDRAM. That code runs about 2.4x slower, and every upload also
# writes it to the flash data partition, from where startup.S copies it
# into SDRAM on reset. Independent of where the SRAM part comes from, so
# both SRAM and Flash have a "+ SDRAM" variant. See docs/PERIPHERALS.md
# "Code in SDRAM".
tangnano20k.menu.boot_mode.sram=SRAM (Default)
tangnano20k.menu.boot_mode.sram.build.boot_flash=0
tangnano20k.menu.boot_mode.sram.build.ldscript=link_cmd.ld
tangnano20k.menu.boot_mode.flash=Flash (fast uploads)
tangnano20k.menu.boot_mode.flash.build.boot_flash=1
tangnano20k.menu.boot_mode.flash.build.ldscript=link_cmd.ld
tangnano20k.menu.boot_mode.sram_sdram=SRAM + SDRAM (large sketches)
tangnano20k.menu.boot_mode.sram_sdram.build.boot_flash=0
tangnano20k.menu.boot_mode.sram_sdram.build.ldscript=link_cmd_sdram.ld
tangnano20k.menu.boot_mode.flash_sdram=Flash + SDRAM (large sketches, fast uploads)
tangnano20k.menu.boot_mode.flash_sdram.build.boot_flash=1
tangnano20k.menu.boot_mode.flash_sdram.build.ldscript=link_cmd_sdram.ld

# Tools > SPI Buses / I2C Buses. Independent, since - unlike what a single
# combined toggle used to imply - the primary SPI (microSD slot's pins) and
# the primary I2C (Wire) cost separate gateware, and the second SPI/I2C
# ports likewise use non-overlapping pins (SPI2: GPIO0-3, I2C2: GPIO4-5,
# not a shared GPIO0-5 block) - see gateware/src/top.v. "One" (the default)
# is the original, always-present primary port each has always shipped
# with. "None" removes that port's gateware entirely (spi_master.v/
# od_gpio2.v cost real LUTs even when a sketch never calls SPI/Wire) -
# SPI/Wire (and anything built on them, e.g. libraries/SD) then silently
# read back 0/no-op instead of talking to real hardware, same as any other
# menu-gated peripheral a sketch uses without enabling it. "Two" adds a
# second, independent port (SPI2/Wire2) on GPIO0-3 (SPI Buses) or GPIO4-5
# (I2C Buses) - real GPIO-pin cost like AI Accelerator's LUT/BRAM cost,
# those pins are unavailable as plain GPIO whenever selected, whether or
# not a sketch actually uses SPI2/Wire2 - see docs/PERIPHERALS.md "SPI,
# I2C (Wire), and the SD card".
tangnano20k.menu.spi_buses.one=One (Default)
tangnano20k.menu.spi_buses.one.build.spi_count=1
tangnano20k.menu.spi_buses.none=None
tangnano20k.menu.spi_buses.none.build.spi_count=0
tangnano20k.menu.spi_buses.two=Two
tangnano20k.menu.spi_buses.two.build.spi_count=2

tangnano20k.menu.i2c_buses.one=One (Default)
tangnano20k.menu.i2c_buses.one.build.i2c_count=1
tangnano20k.menu.i2c_buses.none=None
tangnano20k.menu.i2c_buses.none.build.i2c_count=0
tangnano20k.menu.i2c_buses.two=Two
tangnano20k.menu.i2c_buses.two.build.i2c_count=2

# Tools > Hardware Multiply/Divide. Enabled by default: this changes the
# CPU's actual instruction set (picorv32's M-extension, ENABLE_MUL/
# ENABLE_DIV/ENABLE_FAST_MUL in top.v), so the compiler flag and the
# gateware MUST always change together - a sketch compiled expecting
# hardware mul/div would execute an illegal instruction on a bitstream
# built without this. Both are driven from this single menu choice.
# Speeds up every integer multiply/divide, and every float/double
# operation too (libgcc's software floating-point routines are internally
# built from integer multiplies and shifts - see
# docs/KNOWN_LIMITATIONS.md "No FPU"). build.libgcc_path picks the
# matching pre-built libgcc.a variant already present in the Zephyr SDK -
# see platform.txt. Not the SDK's top-level libgcc.a: that one is built
# for rv32ima, and its routines (64-bit division, all software floating
# point) contain mul/div instructions a plain RV32I CPU traps on - found
# on real hardware, where the first printf("%lu") hung the CPU.
tangnano20k.menu.hw_muldiv.enabled=Enabled (Default)
tangnano20k.menu.hw_muldiv.enabled.build.march_m=m
tangnano20k.menu.hw_muldiv.enabled.build.libgcc_path={compiler.path}../lib/gcc/riscv64-zephyr-elf/12.2.0/rv32im_zicsr_zifencei/ilp32/libgcc.a
tangnano20k.menu.hw_muldiv.enabled.build.hw_muldiv=1
tangnano20k.menu.hw_muldiv.disabled=Disabled (fewer LUTs)
tangnano20k.menu.hw_muldiv.disabled.build.march_m=
tangnano20k.menu.hw_muldiv.disabled.build.libgcc_path={compiler.path}../lib/gcc/riscv64-zephyr-elf/12.2.0/rv32i_zicsr_zifencei/ilp32/libgcc.a
tangnano20k.menu.hw_muldiv.disabled.build.hw_muldiv=0

# Tools > I2S Input. Disabled by default: wires GPIO6 to the I2S
# peripheral's receive input for an external I2S microphone sharing the
# onboard MAX98357A's BCLK/WS lines, enabling I2S.read()/full duplex - see
# gateware/src/i2s.v and docs/PERIPHERALS.md "Audio (I2S)". Real GPIO-pin
# cost like SPI Buses/I2C Buses: Two's, gated the same way - GPIO6 is unavailable as
# plain GPIO whenever this is enabled, whether or not a sketch actually
# calls I2S.read().
tangnano20k.menu.i2s_rx.disabled=Disabled (Default)
tangnano20k.menu.i2s_rx.disabled.build.i2s_rx=0
tangnano20k.menu.i2s_rx.enabled=Enabled
tangnano20k.menu.i2s_rx.enabled.build.i2s_rx=1

# Tools > PWM Audio. Disabled by default: synthesizes a stereo PWM audio
# output (gateware/src/pwm_audio.v, libraries/PWMAudio) onto GPIO16 (left)
# and GPIO17 (right) - see docs/PERIPHERALS.md "Audio (PWM)". Same real
# GPIO-pin cost as I2S Input, gated the same way - both pins are
# unavailable as plain GPIO whenever this is enabled.
tangnano20k.menu.pwm_audio.disabled=Disabled (Default)
tangnano20k.menu.pwm_audio.disabled.build.pwm_audio=0
tangnano20k.menu.pwm_audio.enabled=Enabled
tangnano20k.menu.pwm_audio.enabled.build.pwm_audio=1

# Tools > Flash Cache. Disabled by default: a 512-byte read cache in front
# of the onboard flash (gateware/src/qspi_flash_cached.v) - repeated reads
# of FLASH_DATA/PROGMEM tables drop from ~510 to ~2 clocks, sequential
# reads to ~290, and Boot Mode: Flash boots faster. Costs ~1,700 LUT4s
# (~8% of the FPGA) whether or not a sketch reads flash, hence opt-in.
tangnano20k.menu.flash_cache.disabled=Disabled (Default)
tangnano20k.menu.flash_cache.disabled.build.flash_cache=0
tangnano20k.menu.flash_cache.enabled=Enabled
tangnano20k.menu.flash_cache.enabled.build.flash_cache=1

# Tools > Clock Speed. Unlike every other menu on this board, this isn't a
# software flag - it reconfigures the PLL that clocks the entire SoC
# (gateware/src/gowin_rpll_sys.v) and, in lockstep, sys_parameters.v's
# CLK_FREQ (which top.v feeds to the SDRAM controller and WS2812 driver for
# their own FREQ-derived timing - see tools/build_bitstream.py). Each
# option's IDIV_SEL/FBDIV_SEL/ODIV_SEL was computed for this exact part
# (GW2AR-18C) with apycula's gowin_pll calculator, not hand-derived, since
# only specific divider combinations are valid PLL configurations - do not
# edit these numbers without recomputing them the same way.
#
# Normal (27MHz) is the original, unchanged clock this core has always
# shipped with (IDIV_SEL=0/FBDIV_SEL=0/ODIV_SEL=32 - actually a clean
# pass-through of the 27MHz oscillator, not a real multiply/divide).
#
# Low Power (13.5MHz) roughly halves dynamic power/heat/EMI at the cost of
# proportionally slower UART/I2S/WS2812 timing and sketch execution speed -
# still comfortably within every peripheral's timing margin.
#
# Overclocked (54MHz) was verified against this design's actual synthesized
# timing (yosys -> nextpnr-himbaechel), whose static timing analysis
# reports this specific core closing at ~75MHz with default menu settings
# (AI Accelerator/SPI Buses/I2C Buses: Two/I2S Input disabled) - 54MHz leaves real
# margin under that ceiling. It's also comfortably under sdram.v's own
# documented 66.7MHz ceiling for its current CAS/T_xx timing parameters.
# Enabling other gateware-cost menu options alongside this may add logic
# that lowers the design's actual closing frequency - re-verify timing if
# you combine them.
tangnano20k.menu.f_cpu.normal=Normal (27 MHz) (Default)
tangnano20k.menu.f_cpu.normal.build.f_cpu=27000000L
tangnano20k.menu.f_cpu.normal.build.clk_freq_hz=27000000
tangnano20k.menu.f_cpu.normal.build.pll_idiv=0
tangnano20k.menu.f_cpu.normal.build.pll_fbdiv=0
tangnano20k.menu.f_cpu.normal.build.pll_odiv=32
tangnano20k.menu.f_cpu.low_power=Low Power (13.5 MHz)
tangnano20k.menu.f_cpu.low_power.build.f_cpu=13500000L
tangnano20k.menu.f_cpu.low_power.build.clk_freq_hz=13500000
tangnano20k.menu.f_cpu.low_power.build.pll_idiv=1
tangnano20k.menu.f_cpu.low_power.build.pll_fbdiv=0
tangnano20k.menu.f_cpu.low_power.build.pll_odiv=48
tangnano20k.menu.f_cpu.overclock=Overclocked (54 MHz)
tangnano20k.menu.f_cpu.overclock.build.f_cpu=54000000L
tangnano20k.menu.f_cpu.overclock.build.clk_freq_hz=54000000
tangnano20k.menu.f_cpu.overclock.build.pll_idiv=0
tangnano20k.menu.f_cpu.overclock.build.pll_fbdiv=1
tangnano20k.menu.f_cpu.overclock.build.pll_odiv=16

# Tools > Compressed Instructions. Disabled by default: like Hardware
# Multiply/Divide, this changes the CPU's instruction set (picorv32's
# COMPRESSED_ISA, the RISC-V "C" extension) and the compiler flag
# (build.march_c -> -march=rv32i[m]c_...) together from this one choice.
# Many instructions get a 16-bit encoding - about 18% smaller code on a
# typical sketch (libgcc stays uncompressed, see below) - worth it when a
# sketch is close to the 64KB SRAM limit. Costs
# some LUTs, and fetching misaligned 32-bit instructions can cost an
# extra cycle. libgcc stays the uncompressed build (the Zephyr SDK has no
# RV32IC variant); a C-capable CPU runs it unchanged.
tangnano20k.menu.compressed.disabled=Disabled (Default)
tangnano20k.menu.compressed.disabled.build.march_c=
tangnano20k.menu.compressed.disabled.build.compressed=0
tangnano20k.menu.compressed.enabled=Enabled (smaller code)
tangnano20k.menu.compressed.enabled.build.march_c=c
tangnano20k.menu.compressed.enabled.build.compressed=1

# Tools > Barrel Shifter. Gateware only (no compiler change): picorv32's
# BARREL_SHIFTER makes every shift a single-cycle operation instead of
# one cycle per bit position shifted. Shifts are everywhere - bit
# manipulation, CRCs, fixed-point math and libgcc's software
# floating-point routines - so this speeds up much more than it sounds.
# Costs a few hundred LUTs.
tangnano20k.menu.barrel_shifter.disabled=Disabled (Default)
tangnano20k.menu.barrel_shifter.disabled.build.barrel_shifter=0
tangnano20k.menu.barrel_shifter.enabled=Enabled (faster shifts)
tangnano20k.menu.barrel_shifter.enabled.build.barrel_shifter=1

# Tools > CAN. Disabled by default: synthesizes the CAN 2.0A/B controller
# (gateware/src/can_ctrl.v) for libraries/CAN. Its TX/RX pins are chosen
# at run time (CAN.setPins(), default GPIO18/GPIO11), so enabling it
# claims no GPIO pin up front - only LUTs.
tangnano20k.menu.can.disabled=Disabled (Default)
tangnano20k.menu.can.disabled.build.can=0
tangnano20k.menu.can.enabled=Enabled
tangnano20k.menu.can.enabled.build.can=1
